src/__tests__/get-started/static-xml.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:tns="http://localhost:8001/get-started/service.wsdl">
  <soap:Body>
    <tns:getUserById>
      <id>8104d3c3-de13-432f-b4a0-a62f84f6206a</id>
    </tns:getUserById>
  </soap:Body>
</soap:Envelope>





